export const PACKAGES = [
  {
    name: '标准创业服务套餐(S)',
    contents: ['标准财税服务', '税筹顾问服务', '科技项目研发服务', '创业政策申领', '季度创业报告', '赠500元商标券'],
    ranges: ['科技型企业', '孵化器入驻企业'],
    worth: '19500', sell: 12960
  },
  {
    name: '资本创投服务套餐(VC)',
    contents: ['标准财税服务', '税筹顾问服务', '科技项目研发服务', '财务内控体系建设', '新四板挂牌服务', '季度创业服务', '2家持股平台财税托管服务',
      '赠500元商标券'],
    ranges: ['科技型企业', '已融资或正在融资'],
    worth: '29300', sell: 20160
  },
  {
    name: '高企培育标准套餐(HT1)',
    contents: ['国家高企财务服务', '税筹顾问服务', '创业政策推送', '创业政策申领', '财务内控体系建设', '年度创业报告',
      '赠900元专利券'],
    ranges: ['科技型企业', '高企申报筹备企业', '高新技术企业'],
    worth: '42300', sell: 22800
  }
];
